DataProcessors/ВыгрузкаЗагрузкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаЗагрузкаТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВибыНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйБлок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВыгрузкаЗагрузкаТоваров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыгрузитьТоварыXML()
	ЗаполнитьТаблицуТоваров();
	Файл = Новый ЗаписьXML;
	файл.ОткрытьФайл(КаталогЗагрузки+"\"+"Номенклатура.xml");
	Файл.ЗаписатьОбъявлениеXML();
	Файл.ЗаписатьНачалоЭлемента("Root");
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Файл.ЗаписатьНачалоЭлемента("Номенклатура");
		Файл.ЗаписатьАтрибут("Код",СтрокаТаблицы.Код);
		Файл.ЗаписатьАтрибут("Артикул",СтрокаТаблицы.Артикул);
		Файл.ЗаписатьАтрибут("ЭтоГруппа",?(СтрокаТаблицы.ЭтоГруппа,"1","0"));
		Файл.ЗаписатьАтрибут("Склад",СтрокаТаблицы.Склад);
		Файл.ЗаписатьАтрибут("Ссылка",Строка(СтрокаТаблицы.Ссылка.УникальныйИдентификатор()));
		Файл.ЗаписатьТекст(СтрокаТаблицы.Наименование);
		Файл.ЗаписатьКонецЭлемента();
	КонецЦикла; 
	Файл.ЗаписатьКонецЭлемента();
	Файл.Закрыть();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТаблицуТоваров()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Номенклатура.Предопределенный КАК Предопределенный,
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	Номенклатура.Склад КАК Склад
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.Предопределенный";
	ТаблицаТоваров.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры
&НаКлиенте
Процедура ВыгрузитьТовары(Команда)
	ВыгрузитьТоварыXML();
КонецПроцедуры
&НаКлиенте
Процедура ЗагрузитьXML()
	ТаблицаТоваров.Очистить();
	
	Файл = Новый ЧтениеXML;
	Файл.ОткрытьФайл(КаталогЗагрузки+"\"+"Номенклатура.xml");
	Пока Файл.Прочитать() Цикл
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если Файл.Имя <> "Товар" Тогда
				Продолжить;
			КонецЕсли; 
			Код = "";
			Артикул = "";
			Поставщик = "";
			Наименование = "";
			Ссылка = "";
			ЭтоГруппа = 0;
			
			Пока Файл.ПрочитатьАтрибут() Цикл
				Если Файл.Имя = "Код" Тогда
					Код = Файл.Значение;
				ИначеЕсли Файл.Имя = "Артикул" Тогда
					Артикул = Файл.Значение ;
				ИначеЕсли Файл.Имя = "Поставщик" Тогда
					Поставщик = Файл.Значение ;
				ИначеЕсли Файл.Имя = "Ссылка" Тогда
					Ссылка = Файл.Значение;
				ИначеЕсли Файл.Имя = "ЭтоГруппа" Тогда
					ЭтоГруппа = ?(Файл.Значение = "0", Ложь,Истина);
				КонецЕсли; 
			КонецЦикла;
			Файл.Прочитать();
			Наименование = Файл.Значение ;
			СтрокаТаблицы=ТаблицаТоваров.Добавить();
			СтрокаТаблицы.Код=Код;
			СтрокаТаблицы.Артикул=Артикул;
			СтрокаТаблицы.Наименование=Наименование;
			СтрокаТаблицы.Поставщик = Поставщик;
			СтрокаТаблицы.ЭтоГруппа = ЭтоГруппа;
			СтрокаТаблицы.ИД = Ссылка;
			
		КонецЕсли; 
	КонецЦикла;
	Файл.Закрыть();

КонецПроцедуры	
&НаСервере
Процедура ОбработатьЗагруженныеДанные()
		
	ПустаяСсылка = Справочники.Товары.ПустаяСсылка();
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Родитель) Тогда
			НайденыйРодительСсылка= Справочники.Товары.НайтиПоНаименованию(СтрокаТаблицы.Наименование);
			
			Если НайденыйРодительСсылка =ПустаяСсылка Тогда
				НайденыйРодитель = Справочники.Товары.СоздатьГруппу();
				НайденыйРодитель.Код=СтрокаТаблицы.Код;
				НайденыйРодитель.Наименование=СтрокаТаблицы.Наименование;
				НайденыйРодитель.Артикул = СтрокаТаблицы.Артикул;
				НайденыйРодитель.Склад = СтрокаТаблицы.Склад;
				НайденыйРодитель.УстановитьСсылкуНового( Справочники.Товары.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.ИД)));
				НайденыйРодитель.Записать();
				НайденыйРодительСсылка = НайденыйРодитель.Ссылка; 
				
			КонецЕсли; 
			
		Иначе
			НайденыйРодительСсылка =  ПустаяСсылка;
		КонецЕсли; 
		
		Если СтрокаТаблицы.ЭтоГруппа Тогда
			НовыйЭлемент = Справочники.Товары.СоздатьГруппу();
			НовыйЭлемент.Код=СтрокаТаблицы.Код;
			НовыйЭлемент.Наименование=СтрокаТаблицы.Наименование;
			НовыйЭлемент.Родитель=НайденыйРодительСсылка;
		Иначе
			НовыйЭлемент = Справочники.Товары.СоздатьЭлемент();
			НовыйЭлемент.Код=СтрокаТаблицы.Код;
			НовыйЭлемент.Наименование=СтрокаТаблицы.Наименование;
			НовыйЭлемент.Артикул = СтрокаТаблицы.Артикул;
			НовыйЭлемент.Склад   = СтрокаТаблицы.Склад;
			
			
		КонецЕсли; 
		
		НовыйЭлемент.Родитель = НайденыйРодительСсылка;
		
		НовыйЭлемент.УстановитьСсылкуНового(Справочники.Товары.ПолучитьСсылку(Новый УникальныйИдентификатор (СтрокаТаблицы.ИД)));
		
	
		Попытка
			
			НовыйЭлемент.Записать();
			
		Исключение
			
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры // ОбработатьЗагруженныеДанные()
&НаКлиенте
Процедура ЗагрузитьТовары(Команда)
	ЗагрузитьXML();
	ОбработатьЗагруженныеДанные();
КонецПроцедуры
